Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: The first thing to point out about portability is that not all browsers run on all operating systems. While { -brand-name-firefox }, { -brand-name-chrome } and { -brand-name-opera } work on all major systems and are easy to install, { -brand-name-ie }, { -brand-name-edge } and { -brand-name-safari } only work on { -brand-name-microsoft } and Apple’s own systems. The mobile version of { -brand-name-safari } is pre-installed on Apple’s mobile devices, and most { -brand-name-android } devices come with a pre-installed browser modified by the manufacturer for the device. { -brand-name-firefox }, { -brand-name-chrome }, { -brand-name-edge } and { -brand-name-opera } can easily be installed and even used side by side.
am: ስለ ተንቀሳቃሽነት ለመጠቆም የመጀመሪያው ነገር ሁሉም አሳሾች በሁሉም ስርዓተ ክወናዎች ላይ የሚሰሩ አይደሉም። { -brand-name-firefox }፣ { -brand-name-chrome } እና { -brand-name-opera } በሁሉም ዋና ስርዓቶች ላይ የሚሰሩ እና ለመጫን ቀላል ናቸው፣ { -brand-name-ie }፣ { -brand-name-edge } እና { -brand-name-safari } በ{ -brand-name-microsoft } እና በአፕል የራሱ ስርዓቶች ላይ ብቻ ይሰራሉ። የ{ -brand-name-safari } የሞባይል ሥሪት በአፕል ሞባይል መሳሪያዎች ላይ ቀድሞ ተጭኗል፣ እና አብዛኛዎቹ { -brand-name-android } መሳሪያዎች በአምራቹ የተቀየረ ቀድሞ ከተጫነ አሳሽ ጋር አብረው ይመጣሉ። { -brand-name-firefox }፣ { -brand-name-chrome }፣ { -brand-name-edge } እና { -brand-name-opera } በቀላሉ ሊጫኑ እና ጎን ለጎን ጥቅም ላይ ይውላሉ።

source: The first thing to point out about portability is that not all browsers run on all operating systems. While { -brand-name-firefox }, { -brand-name-chrome }, { -brand-name-edge }, { -brand-name-brave } and { -brand-name-opera } work on all major systems and are easy to install, { -brand-name-ie } and { -brand-name-safari } only work on { -brand-name-microsoft } and Apple’s own systems. The mobile version of { -brand-name-safari } is pre-installed on Apple’s mobile devices, and most { -brand-name-android } devices come with a pre-installed browser modified by the manufacturer for the device. { -brand-name-firefox }, { -brand-name-chrome }, { -brand-name-brave }, { -brand-name-edge } and { -brand-name-opera } can easily be installed and even used side by side.
am: ስለ ተንቀሳቃሽነት ለመጠቆም የመጀመሪያው ነገር ሁሉም አሳሾች በሁሉም ስርዓተ ክወናዎች ላይ የሚሰሩ አይደሉም። { -brand-name-firefox }፣ { -brand-name-chrome }፣ { -brand-name-edge }፣ { -brand-name-brave } እና { -brand-name-opera } በሁሉም ዋና ስርዓቶች ላይ የሚሰሩ እና ለመጫን ቀላል ናቸው፣ { -brand-name-ie } እና { -brand-name-safari } በ{ -brand-name-microsoft } እና በአፕል የራሱ ስርዓቶች ላይ ብቻ ይሰራሉ። የ{ -brand-name-safari } የሞባይል ሥሪት በአፕል ሞባይል መሳሪያዎች ላይ ቀድሞ ተጭኗል፣ እና አብዛኛዎቹ { -brand-name-android } መሳሪያዎች በአምራቹ የተቀየረ ቀድሞ ከተጫነ አሳሽ ጋር አብረው ይመጣሉ። { -brand-name-firefox }፣ { -brand-name-chrome }፣ { -brand-name-brave }፣ { -brand-name-edge } እና { -brand-name-opera } በቀላሉ ሊጫኑ እና ጎን ለጎን ጥቅም ላይ ይውላሉ።

source: The future is full of challenges and opportunities equal to those of our past.
am: መጪው ጊዜ ካለፉት ጊዜያት ጋር እኩል በሆኑ ፈተናዎች እና እድሎች የተሞላ ነው።

source: The Internet as a whole is largely paid for by display advertisements, which keeps the actual content you want to view free. { -brand-name-brave } has attempted to upend this model by encouraging its users to opt into { -brand-name-brave }’s own reward system, which in reality, is its own ad platform. Once a user has opted-in, { -brand-name-brave } will display what they call “privacy-respecting ads” for which you can view and earn what they call a Basic Attention Token a.k.a. a BAT. From this point { -brand-name-brave } users can choose to spend their BATs on supporting the sites or individual contributors they love, who in turn can convert the BATs into actual currency.
am: በይነመረቡ በአጠቃላይ በአብዛኛው የሚከፈለው በማሳያ ማስታዎቂያዎች ሲሆን ይህም ማየት የሚፈልጉትን ትክክለኛ ይዘት ነጻ ያደርገዋል። { -brand-name-brave } ተጠቃሚዎቹ ወደ { -brand-name-brave } የራሱ የሽልማት ስርዓት እንዲገቡ በማበረታታት ይህንን ሞዴል ከፍ ለማድረግ ሞክሯል፣ ይህም በእውነቱ የራሱ የማስታወቂያ መድረክ ነው። ተጠቃሚው መርጦ ከገባ በኋላ { -brand-name-brave } “ግላዊነትን የሚያከብር ማስታወቂያዎች” የሚሉትን ያሳያል ለዚህም እርስዎ ማየት እና መሰረታዊ ትኩረት ቶከን (BAT) የሚሉትን ያገኛሉ። ከዚህ ነጥብ { -brand-name-brave } ተጠቃሚዎች BATs የሚወዷቸውን ገፆች ወይም ግለሰብ አስተዋፅዖ አበርካቾችን ለመደገፍ መምረጥ ይችላሉ።

source: The internet is only global if it’s understood everywhere. Help us translate { -brand-name-mozilla } products and websites into your local language.
am: በይነመረብ በሁሉም ቦታ ከተረዳ ብቻ ዓለም አቀፋዊ ነው። የ{ -brand-name-mozilla } ምርቶችን እና ድር ጣቢያዎችን ወደ አካባቢያዊ ቋንቋዎ ለመተርጎም ያግዙን።

source: The latest { -brand-name-firefox } engine: { -brand-name-firefox-quantum }
am: የቅርብ ጊዜው የ{ -brand-name-firefox } ሞተር፡- { -brand-name-firefox-quantum }

source: The more you use it, the smarter it gets. { -brand-name-firefox } home screen adapts to you and makes it easier to always pick up right where you left off.
am: ብዙ በተጠቀሙበት ቁጥር ብልህ ይሆናል። { -brand-name-firefox } መነሻ ገጽ ለእርስዎ ይስማማል እና ሁልጊዜ ካቆሙበት ለመቀጠል ቀላል ያደርገዋል።

source: The new { -brand-name-mozilla-foundation } continued the role of managing the daily operations of the project and also officially took on the role of promoting <a href="{ $manifesto }">openness, innovation and opportunity</a> on the internet.
am: አዲሱ { -brand-name-mozilla-foundation } የፕሮጀክቱን የእለት ተእለት ስራዎችን የማስተዳደር ሚናውን የቀጠለ ሲሆን በተጨማሪም <a href="{ $manifesto }">ክፍትነትን፣ ፈጠራን እና እድልን የማስተዋወቅ ሚናውን በይፋ ተወጥቷል። </a> በይነመረብ ላይ።

source: The non-profit behind { -brand-name-firefox } is fighting for a healthy internet for all.
am: ከ{ -brand-name-firefox } በስተጀርባ ያለው ለትርፍ ያልተቋቋመው ጤናማ በይነመረብ ለሁሉም እየታገለ ነው።

source: There are a few security features in { -brand-name-brave } worth highlighting, such as its automatic HTTPS connection upgrades (which { -brand-name-firefox } also offers by <a { $extension }>extension</a>). { -brand-name-brave } and { -brand-name-firefox } both offer users a native <a { $lockwise }>password manager</a> and the ability to check their security statistics anytime. { -brand-name-brave } displays stats like the number of trackers it has blocked whenever you open a new tab. { -brand-name-firefox } displays similar information when you view <a { $privacy }>your privacy report</a> which can be accessed anytime by clicking the shield in the address bar.
am: በ{ -brand-name-brave } ውስጥ እንደ ራስ ሰር የኤችቲቲፒኤስ ግንኙነት ማሻሻያዎች ({ -brand-name-firefox } እንዲሁም በ<a { $extension }>ቅጥያ</a> የሚያቀርበው በ{ -brand-name-brave } ውስጥ ያሉ ጥቂት የደህንነት ባህሪያት አሉ። ). { -brand-name-brave } እና { -brand-name-firefox } ሁለቱም ለተጠቃሚዎች ቤተኛ <a { $lockwise }>የይለፍ ቃል አስተዳዳሪ</a> እና በማንኛውም ጊዜ የደህንነት ስታቲስቲክስ የመፈተሽ ችሎታ ይሰጣሉ። { -brand-name-brave } አዲስ ትር በከፈቱ ቁጥር እንደከለከለው የመከታተያ ብዛት አይነት ስታቲስቲክስን ያሳያል። { -brand-name-firefox } <a { $privacy }>የእርስዎን የግላዊነት ሪፖርት</a> ሲመለከቱ ተመሳሳይ መረጃ ያሳያል ይህም በአድራሻ አሞሌው ውስጥ ያለውን ጋሻ ጠቅ በማድረግ በማንኛውም ጊዜ ሊደረስበት ይችላል።

source: There is a way to protect your privacy. Join { -brand-name-firefox }.
am: የእርስዎን ግላዊነት የሚጠብቁበት መንገድ አለ። { -brand-name-firefox }ን ይቀላቀሉ።

source: There is a way to protect your privacy. <span>Join { -brand-name-firefox }.</span>
am: የእርስዎን ግላዊነት የሚጠብቁበት መንገድ አለ። <span>ይቀላቀሉ { -brand-name-firefox }።</span>

source: The renewed competition has <a href="{ $innovation }">accelerated innovation</a> and improved the internet for everyone.
am: የታደሰው ውድድር <a href="{ $innovation }">የተፋጠነ ፈጠራ</a> ያለው ሲሆን ለሁሉም ሰው በይነመረብን አሻሽሏል።

source: There’s no debate that { -brand-name-opera } is a feature-packed browser with a clean user interface and strong customization options. Because { -brand-name-opera } is built on { -brand-name-chromium }, it can take advantage of most of { -brand-name-google } { -brand-name-chrome }’s vast extension library. { -brand-name-firefox } also features a large <a { $attrs }>extension library to browse</a>, but not quite as large as { -brand-name-chrome }’s.
am: { -brand-name-opera } ንፁህ የተጠቃሚ በይነገጽ እና ጠንካራ የማበጀት አማራጮች ያለው በባህርያት የታጨቀ አሳሽ ስለመሆኑ ምንም ክርክር የለም። ምክንያቱም{ -brand-name-opera } በ{ -brand-name-chromium } ላይ ስለተገነባ፣ አብዛኛው የ{ -brand-name-google } { -brand-name-chrome } ሰፊውን የቅጥያ ስብስብ ሊጠቀም ይችላል። { -brand-name-firefox } በተጨማሪም ትልቅ <a { $attrs }>የሚቃኝ የቅጥያ ስብስብ</a> አለው ነገር ግን የ{ -brand-name-chrome }ን ያህል ትልቅ አይደለም።

source: There’s no guarantee that the internet will remain open or enjoyable or safe.
am: በይነመረቡ ክፍት ወይም አስደሳች ወይም ደህንነቱ የተጠበቀ ለመሆኑ ምንም ዋስትና የለም።

source: This page is updated semi-quarterly to reflect latest versioning and may not always reflect latest updates.
am: ይህ ገጽ የቅርብ ጊዜውን ስሪት ለማንፀባረቅ በግማሽ ሩብ የዘመነ ነው እና ሁልጊዜ የቅርብ ጊዜ ዝመናዎችን ላያንጸባርቅ ይችላል።

source: Timeline of { -brand-name-mozilla } Project
am: የ{ -brand-name-mozilla } ፕሮጀክት የጊዜ መስመር

source: Translate content
am: ይዘትን ተርጉም

source: Try New Browser Features in Pre-Release Versions | { -brand-name-firefox }
am: በቅድመ-መለቀቅ ስሪቶች ውስጥ አዲስ የአሳሽ ባህሪያትን ይሞክሩ | { -brand-name-firefox }

source: Try <strong>{ -brand-name-firefox-focus }</strong>, the privacy browser for { -brand-name-android } and { -brand-name-ios }.
am: የ{ -brand-name-android } እና { -brand-name-ios }ን የግላዊነት ማሰሻ የሆነውን <strong>{ -brand-name-firefox-focus }</strong>ን ይሞክሩ።

source: Ubuntu
am: ኡቡንቱ

source: Ubuntu { $version } and up
am: ኡቡንቱ { $version } እና በላይ

source: Ultimately, it’s up to you to decide whether or not or where to draw the line with sharing things like your search history and shopping history. But if you’re anything like most people, you’ve probably searched for some things on the internet that you would rather keep private.
am: በመጨረሻም፣ እንደ የፍለጋ ታሪክዎ እና የግዢ ታሪክዎ ያሉ ነገሮችን በማጋራት መስመር መሳል ወይም አለማድረግ የርስዎ ምርጫ ነው። ነገር ግን ልክ እንደ አብዛኞቹ ሰዎች ከሆኑ ምናልባት ሚስጥራዊ እንዲሆኑ የሚመርጧቸውን አንዳንድ ነገሮች በይነመረብ ላይ ፈልገው ይሆናል።

source: Update your { -brand-name-firefox }
am: የእርስዎን { -brand-name-firefox } ያዘምኑ

source: Using a browser that blocks third-party trackers isn’t just important for privacy — it usually means it runs much faster, too. Most trackers are just scripts that run in the background on a number of websites. You can’t see them, but you can feel them slowing down your browser. As of version 67 of { -brand-name-firefox }, fingerprinting and cryptominers are also blocked. If you’re not familiar with cryptominers, here’s an example of how they can affect you: maybe you’ve experienced your computer suddenly running hotter or the battery depleting faster than normal. That’s often the byproduct of cryptominers creeping around on your device.
am: የሶስተኛ ወገን መከታተያዎችን የሚያግድ አሳሽ መጠቀም አስፈላጊነት ለግላዊነት ብቻ አይደለም - ብዙውን ጊዜ በፍጥነት ይሰራልም ማለት ነው። አብዛኞቹ መከታተያዎች በበርካታ ድረ-ገጾች ላይ ከበስተጀርባ የሚሰሩ ስክሪፕቶች ናቸው። እርስዎ እነሱን ማየት አይችሉም፣ ግን አሳሽዎን ሲያዘገዩ ሊሰማዎት ይችላል። እንደ { -brand-name-firefox } ስሪት 67፣ የአሳሽ ተከታታይ እና የምናባዊ ገንዘብ ቆፋሪዎች እንዲሁ ታግደዋል። ስለ ምናባዊ ገንዘብ ቆፋሪዎች የማያውቁ ከሆነ፣ እርስዎን እንዴት ሊነኩ እንደሚችሉ የሚያሳይ ምሳሌ ይኸውና፡- ምናልባት ኮምፒውተርዎ በድንገት ሲሞቅ ወይም ባትሪው ከመደበኛው በበለጠ ፍጥነት እየቀነሰ ሲሄድ አጋጥሞዎት ይሆናል። ያ ብዙ ጊዜ በመሳሪያዎ ላይ የሚሽከረከሩ የምናባዊ ገንዘብ ቆፋሪዎች ውጤት ነው።

source: Using the web as the platform, we build open, innovative technologies that allow developers to work free of closed, corporate ecosystems and create faster, safer web experiences for us all.
am: ድሩን እንደ መድረክ በመጠቀም ገንቢዎች ከተዘጉ ድርጅታዊ ሥነ-ምህዳር ነፃ ሆነው እንዲሰሩ እና ፈጣን እና ደህንነቱ የተጠበቀ የድር ተሞክሮዎችን ለሁላችንም እንዲፈጥሩ የሚያስችል ክፍት እና አዳዲስ ቴክኖሎጂዎችን እንገነባለን።

source: Utility
am: መገልገያ

source: Version { $version } and up
am: ስሪት { $version } እና በላይ

source: View all
am: ሁሉንም ይመልከቱ

source: View all { -brand-name-firefox-browsers }
am: ሁሉንም { -brand-name-firefox-browsers } ይመልከቱ

source: View all Products
am: ሁሉንም ምርቶች ይመልከቱ

source: Virtual Reality Platform
am: ምናባዊ እውነታ መድረክ

source: Visit <a href="{ $url }">{ $link_copy }</a> to get { -brand-name-firefox } for Desktop.
am: ለዴስክቶፕ { -brand-name-firefox } ለማግኘት <a href="{ $url }">{ $link_copy }</a>ን ይጎብኙ።

source: Visit <a { $moco_link }>{ -brand-name-mozilla-corporation }’s</a> not-for-profit parent, the <a { $mofo_link }>{ -brand-name-mozilla-foundation }</a>.
am: የ<a { $moco_link }>{ -brand-name-mozilla-corporation }ን</a> ለትርፍ ያልተቋቋመ እናት ድርጅትን <a { $mofo_link }>{ -brand-name-mozilla-foundation }</a> ይጎብኙ።

source: Volunteer Opportunities at { -brand-name-mozilla }
am: የበጎ ፈቃደኝነት እድሎች በ{ -brand-name-mozilla }

source: VPN for { -brand-name-android }
am: ቪፒኤን ለ{ -brand-name-android }

source: VPN for { -brand-name-ios }
am: ቪፒኤን ለ{ -brand-name-ios }

source: VPN for { -brand-name-linux }
am: ቪፒኤን ለ{ -brand-name-linux }

source: VPN for { -brand-name-mac-short }
am: ቪፒኤን ለ{ -brand-name-mac-short }

source: VPN for { -brand-name-windows }
am: ቪፒኤን ለ{ -brand-name-windows }

source: VPN for { -brand-name-windows } 10/11
am: ቪፒኤን ለ{ -brand-name-windows } 10/11

source: VPN Resource Center
am: የቪፒኤን የመረጃ ማዕከል

source: VPN vs Proxy
am: ቪፒኤን ከ ተኪ ንፅፅር

source: Want privacy on every device?
am: በእያንዳንዱ መሳሪያ ላይ ግላዊነትን ይፈልጋሉ?

source: Want to get more involved in the { -brand-name-mozilla } community? Check out all the volunteer opportunities in our Community Portal.
am: በ{ -brand-name-mozilla } ማህበረሰብ ውስጥ የበለጠ መሳተፍ ይፈልጋሉ? በማህበረሰብ ፖርታል ውስጥ ያሉትን ሁሉንም የበጎ ፈቃድ እድሎች ይመልከቱ።

source: Was this article helpful?
am: ይህ ጽሑፍ አጋዥ ነበር?

source: Watch for hackers with { -brand-name-firefox-monitor }, protect passwords with { -brand-name-firefox-lockwise }, and more.
am: ሰርጎ ገቦችን በ{ -brand-name-firefox-monitor } ይመልከቱ፣ የይለፍ ቃሎችን በ{ -brand-name-firefox-lockwise } ይጠብቁ እና ሌሎችም።

source: Watch for hackers with { -brand-name-firefox-monitor }, protect your email address with { -brand-name-firefox-relay }, and more.
am: ሰርጎ ገቦችን በ{ -brand-name-firefox-monitor } ይመልከቱ፣ የኢሜይል አድራሻዎን በ{ -brand-name-firefox-relay } ይጠብቁ እና ሌሎችም።

source: Watch videos and browse the internet on your { -brand-name-amazon } { -brand-name-fire-tv }.
am: ቪዲዮዎችን ይመልከቱ እና በይነመረቡን በእርስዎ { -brand-name-amazon } { -brand-name-fire-tv } ላይ ያስሱ።

source: We also offer an additional, albeit experimental version of our { -brand-name-firefox } mobile app, <a { $attrs }>{ -brand-name-firefox } Preview</a>, which focuses on speed and security.
am: እንዲሁም የእኛን { -brand-name-firefox } የሞባይል መተግበሪያ <a { $attrs }>{ -brand-name-firefox } ቅድመ እይታ</a>ን በፍጥነት እና ደህንነት ላይ የሚያተኩር ተጨማሪ፣ ምንም እንኳን የሙከራ ስሪት ቢሆንም እናቀርባለን።

source: We believe community collaboration is vital to creating an internet that is diverse, innovative, and accountable to the people who need it most. Whether you have a background in tech, community organizing, or just a computer and some free time, you can help us make the internet a better place.
am: የተለያዩ፣ ፈጠራ ያለው እና በጣም ለሚፈልጉት ሰዎች ተጠያቂ የሆነ በይነመረብ ለመፍጠር የማህበረሰብ ትብብር አስፈላጊ ነው ብለን እናምናለን። በቴክኒክ፣ በማህበረሰብ ማደራጀት ወይም በኮምፒዩተር ብቻ እና የተወሰነ ነፃ ጊዜ ካለዎ በይነመረቡን የተሻለ ቦታ እንድናደርስው ሊረዱን ይችላሉ።

source: We believe everyone should have access to the internet — that’s why we make the { -brand-name-firefox-browser } available in more than 90 languages with the help of dedicated volunteers around the world.
am: ሁሉም ሰው የበይነመረብ መዳረሻ ሊኖረው ይገባል ብለን እናምናለን - ለዛ ነው { -brand-name-firefox-browser }ን በዓለም ዙሪያ ባሉ በጎ ፈቃደኞች በመታገዝ ከ90 በላይ ቋንቋዎች እንዲገኝ የምናደርገው።

source: Web extensions/Add-ons
am: የድር ቅጥያዎች/ተጨማሪዎች

source: Webmaker
am: የድር ሰሪ

source: Web of Things (IoT)
am: የነገሮች ድር (IoT)

source: Website Privacy Notice
am: የድረ-ገፅ ግላዊነት ማስታወቂያ

source: We compare { -brand-name-mozilla } { -brand-name-firefox } with { -brand-name-google } { -brand-name-chrome } in terms of privacy, utility and portability
am: { -brand-name-mozilla } { -brand-name-firefox }ን ከ{ -brand-name-google } { -brand-name-chrome } ጋር በግላዊነት፣ ግልጋሎት እና ተንቀሳቃሽነት እናነፃፅራለን

source: We currently offer { -brand-name-mozilla-vpn } in Austria, Belgium, Bulgaria, Canada, Croatia, Cyprus, the Czech Republic, Denmark, Estonia, Finland, France, Germany, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malaysia, Malta, the Netherlands, New Zealand, Poland, Portugal, Romania, Singapore, Slovenia, Slovakia, Spain, Sweden, Switzerland, the UK, and the US.
am: በአሁኑ ጊዜ { -brand-name-mozilla-vpn } በኦስትሪያ፣ ቤልጂየም፣ ቡልጋሪያ፣ ካናዳ፣ ክሮኤሺያ፣ ቆጵሮስ፣ ቼክ ሪፐብሊክ፣ ዴንማርክ፣ ኢስቶኒያ፣ ፊንላንድ፣ ፈረንሳይ፣ ጀርመን፣ ሃንጋሪ፣ አየርላንድ፣ ጣሊያን፣ ላቲቪያ፣ ሊቱዌኒያ እናቀርባለን ሉክሰምበርግ፣ ማሌዢያ፣ ማልታ፣ ኔዘርላንድስ፣ ኒውዚላንድ፣ ፖላንድ፣ ፖርቱጋል፣ ሮማኒያ፣ ሲንጋፖር፣ ስሎቬንያ፣ ስሎቫኪያ፣ ስፔን፣ ስዊድን፣ ስዊዘርላንድ፣ እንግሊዝ እና አሜሪካ እናቀርባለን።

source: We currently offer { -brand-name-mozilla-vpn } in Austria, Belgium, Canada, Finland, France, Germany, Ireland, Italy, Malaysia, the Netherlands, New Zealand, Singapore, Spain, Sweden, Switzerland, the UK, and the US.
am: በአሁኑ ጊዜ { -brand-name-mozilla-vpn }ን በኦስትሪያ፣ ቤልጂየም፣ ካናዳ፣ ፈረንሳይ፣ ጀርመን፣ አየርላንድ፣ ጣሊያን፣ ማሌዥያ፣ ኔዘርላንድስ፣ ኒውዚላንድ፣ ሲንጋፖር፣ ስፔን፣ ስዊዘርላንድ፣ ዩናይትድ ኪንግደም እና ዩኤስ ውስጥ እናቀርባለን።

source: We currently offer { -brand-name-mozilla-vpn } in Austria, Belgium, Canada, France, Germany, Ireland, Italy, Malaysia, the Netherlands, New Zealand, Singapore, Spain, Switzerland, the UK, and the US.
am: በአሁኑ ጊዜ { -brand-name-mozilla-vpn }ን በኦስትሪያ፣ ቤልጂየም፣ ካናዳ፣ ፈረንሳይ፣ ጀርመን፣ አየርላንድ፣ ጣሊያን፣ ማሌዥያ፣ ኔዘርላንድስ፣ ኒውዚላንድ፣ ሲንጋፖር፣ ስፔን፣ ስዊዘርላንድ፣ ዩናይትድ ኪንግደም እና ዩኤስ ውስጥ እናቀርባለን።

source: Welcome to the all-new { -brand-name-firefox-quantum }: { -brand-name-developer-edition }
am: እንኳን ወደ አዲሱ { -brand-name-firefox-quantum }:- { -brand-name-developer-edition } በደህና መጡ

source: We make { -brand-name-firefox } for people like you, who care deeply about personal privacy and security. That’s why we collect so little info about users and are transparent about how we use that info. It’s hard to know how { -brand-name-opera } is operating from a privacy perspective. While there are robust privacy features, how they themselves collect and share your data is murky. { -brand-name-firefox } remains consistent in what we say and what we do in protecting your privacy.
am: { -brand-name-firefox }ን የምንሰራው እንደእርስዎ ላሉ ስለ ግላዊነት እና ደህንነት በጥልቀት ለሚጠነቀቁ ሰዎች ነው። ለዚያም ነው ስለተጠቃሚዎች በጣም ትንሽ መረጃ የምንሰበስበው እና ያንን መረጃ እንዴት እንደምንጠቀምበት ግልጽ የምንሆነው። { -brand-name-opera } ከግላዊነት አንፃር እንዴት እንደሚሰራ ማወቅ ከባድ ነው። ጠንካራ የግላዊነት ባህሪያት ቢኖሩትም እነሱ ራሳቸው እንዴት የእርስዎን ውሂብ እንደሚሰበስቡ እና እንደሚያጋሩት ግልፅ አይደለም። { -brand-name-firefox } የእርስዎን ግላዊነት ለመጠበቅ በምንናገረው እና በምንሰራው ነገር ላይ ወጥነት ያለው ሆኖ ይቆያል።

source: We make the internet safer, healthier and faster for good.
am: በይነመረብን በዘላቂነት ደህንነቱ የተጠበቀ፣ ጤናማ እና ፈጣን እናደርገዋለን።

source: We never log, track, or share your network data
am: የእርስዎን የአውታረ መረብ ውሂብ አንመዘግብም፣ አንከታተልም ወይም አናጋራም

source: We never log, track, or share your network data.
am: የእርስዎን የአውታረ መረብ ውሂብ አንመዘግብም፣ አንከታተልም ወይም አናጋራም።

source: We’re backed by <a href="{ $mozilla }">{ -brand-name-mozilla }</a>, the not-for-profit organization that puts people over profit to give everyone more power online. We created this extension because we believe that you should have easy-to-use tools that help you manage your privacy and security.
am: እኛ የምንደገፈው በ <a href="{ $mozilla }">{ -brand-name-mozilla } ሲሆን፤ ለትርፍ ያልተቋቋመ፣ የህዝብን የመስመር ላይ አጠቃቀም አቅም ለመጨመር የሚሠራ ድርጅት ነው። ይኼንን ቅጥያ የፈጠርንበት ዋናው ምክንያት፤ የርስዎን ደህነነትና ግላዊነት የሚጠብቁበት ለአጠቃቀም ቀላል የሆነ መገልገያ ያስፈልግዎታል ብለን ስላሰብን ነው።

source: We think it’s fair to say { -brand-name-firefox } and { -brand-name-chrome } are really neck and neck in terms of portability and utility, with { -brand-name-chrome } having a slight edge in utility because of its huge library of extensions and add-on features. But in terms of Privacy, { -brand-name-firefox } wins the day with our commitment to preserving our users’ online data and providing free baked-in services like password managers that also alert you if there happens to be a data breach involving your credentials.
am: { -brand-name-firefox } እና { -brand-name-chrome } ከተንቀሳቃሽነት እና ከመገልገያ አንፃር በእውነት አንገት እና አንገት ናቸው፣ { -brand-name-chrome } በፍጆታ ውስጥ ትንሽ ጠርዝ አላቸው ማለት ተገቢ ይመስለናል በግዙፉ የቅጥያዎች እና ተጨማሪ ባህሪያት ቤተ-መጽሐፍት ምክንያት። ነገር ግን ከግላዊነት አንፃር፣ { -brand-name-firefox } የተጠቃሚዎቻችንን የመስመር ላይ ውሂብ ለመጠበቅ ባለን ቁርጠኝነት እና እንደ የይለፍ ቃል አስተዳዳሪዎች ያሉ ነፃ አስተማማኝ አገልግሎቶችን ለማቅረብ ባለን ቁርጠኝነት ቀኑን ያሸንፋል ይህም የውሂብ ጥሰት ካለም ያሳውቅዎታል።

source: We use cookies to understand which affiliate partner led you to { -brand-name-mozilla-vpn }. We do not share personally identifying information with our partners. Read our <a { $attrs }>Privacy Policy</a>.
am: የትኛው የእኛ አጋር ወደ { -brand-name-mozilla-vpn } እንደመራዎ ለማወቅ ኩኪዎችን እንጠቀማለን። የግል መለያ መረጃን ከአጋሮቻችን ጋር አንጋራም። የእኛን <a { $attrs }>የግላዊነት መመሪያ</a> ያንብቡ።

source: We’ve also recently restated our commitment to privacy and transparency regarding user data in our most recent <a { $attrs }>Privacy Notice</a> that states, “At { -brand-name-mozilla }, we believe that privacy is fundamental to a healthy internet.”
am: እንዲሁም የተጠቃሚ ውሂብን በተመለከተ ለግላዊነት እና ግልጽነት ያለንን ቁርጠኝነት በቅርቡ <a { $attrs }>የግላዊነት ማስታወቂያ</a> ላይ ደግመን ገልጸናል፣ “በ{ -brand-name-mozilla } ውስጥ፣ ግላዊነት ለጤናማ በይነመረብ መሠረት መሆኑን እናምናለን።"

source: We’ve also recently restated our commitment to privacy and transparency regarding user data in our most recent <a { $attrs }>Privacy Notice</a> that states, “At Mozilla, we believe that privacy is fundamental to a healthy internet.”
am: እንዲሁም የተጠቃሚ መረጃን በተመለከተ ለግላዊነት እና ግልጽነት ያለንን ቁርጠኝነት በቅርብ ጊዜ <a { $attrs }>የግላዊነት ማስታወቂያ</a> ላይ በድጋሚ ገለጽነው፣ “በሞዚላ፣ ግላዊነት ለጤናማ በይነመረብ መሰረታዊ ነገር ነው። ”

source: What has your browser done for you lately?
am: አሳሽዎ በቅርቡ ምን አደረገልዎ?

source: What is a Browser?
am: አሳሽ ምንድን ነው?

source: What is { -brand-name-mozilla-vpn }?
am: { -brand-name-mozilla-vpn } ምንድን ነው?

source: What might surprise some new { -brand-name-brave } users is just how fast pages tend to load in the browser. The reason for these speedy load times is that pages load much quicker when you block all of the advertising on them. There’s simply less to load so it takes less time.
am: አንዳንድ አዳዲስ { -brand-name-brave } ተጠቃሚዎችን ሊያስደንቅ የሚችለው ነገር ገፆች በአሳሹ ውስጥ ምን ያህል በፍጥነት እንደሚጫኑ ነው። የእነዚህ ፈጣን ጭነት ጊዜዎች ምክንያቱ ሁሉንም ማስታወቂያዎች በእነሱ ላይ ሲያግዱ ገጾቹ በፍጥነት ስለሚጫኑ ነው። በቀላሉ ለመጫን ያነሰ ስለሆነ ትንሽ ጊዜ ይወስዳል።

source: What’s an IP address?
am: አይፒ አድራሻ ምንድን ነው?

source: What’s a VPN?
am: ቪፒኤን ምንድን ነው?

source: What’s new with { -brand-name-firefox } - More privacy, more protections.
am: በ{ -brand-name-firefox } ላይ ምን አዲስ ነገር አለ - ተጨማሪ ግላዊነት፣ ተጨማሪ ጥበቃዎች።

source: What’s the deal with Virtual Private Networks?
am: ከቨርቹዋል የግል አውታረ መረቦች ጋር ያለው ስምምነት ምንድን ነው?

source: What you do online literally shouldn’t be anyone else’s business.
am: በመስመር ላይ የምትሰራው ነገር የሌላ ሰው ጉዳይ መሆን የለበትም።

source: What you’ll get with { -brand-name-mozilla-vpn }:
am: በ{ -brand-name-mozilla-vpn } ምን ያገኛሉ፡-

source: When comparing the two browsers, both { -brand-name-firefox } and { -brand-name-brave } offer a sophisticated level of privacy and security by default, available automatically from the very first time you open them.
am: ሁለቱን አሳሾች በሚያወዳድሩበት ጊዜ፣ ሁለቱም { -brand-name-firefox } እና { -brand-name-brave } በነባሪነት የተራቀቀ የግላዊነት እና የደህንነት ደረጃ ያቀርባሉ፣ ከመጀመሪያው ጊዜ ጀምሮ ወዲያውኑ ይገኛል።

source: When to use a VPN
am: ቪፒኤን መቼ መጠቀም አለብን

source: When you contribute to { -brand-name-mozilla }, you become part of a worldwide community made up of people from around the globe who believe that we all have a role in ensuring that the internet remains a force for good.
am: ለ{ -brand-name-mozilla } ሲያዋጡ፣ በይነመረብ ለበጎ ኃይል ሆኖ እንዲቀጥል ሁላችንም ሚና እንዳለን የሚያምኑ ከዓለም ዙሪያ የተውጣጡ ሰዎች ያቀፈ የአለም ማህበረሰብ አካል ይሆናሉ።

source: *when you subscribe to a 12-month plan
am: * ለ12 ወራት እቅድ ሲመዘገቡ

source: When you use { -brand-name-firefox }, you help { -brand-name-mozilla } fight misinformation online, teach digital skills and make the comments section more human. Check out what helps create a healthier internet.
am: { -brand-name-firefox }ን ሲጠቀሙ { -brand-name-mozilla } በመስመር ላይ የተሳሳቱ መረጃዎችን ለመዋጋት፣ ዲጂታል ክህሎቶችን ለማስተማር እና የአስተያየቶች ክፍሉን የበለጠ ሰዋዊ እንዲሆን ይረዳሉ። ጤናማ በይነመረብ ለመፍጠር ምን እንደሚረዳ ይመልከቱ።

source: Whether this sounds complicated or like a great idea, probably depends on your level of contempt for the display advertising on the Internet. Most Internet users understand that good content costs money, and are okay with the fact that the money comes from advertising.
am: ይህ የተወሳሰበ ቢመስልም ወይም እንደ ጥሩ ሀሳብ፣ ምናልባት በበይነመረብ ላይ ላለው የማሳያ ማስታወቂያ ባለዎት ንቀት ላይ የተመሠረተ ነው። ብዙ የበይነመረብ ተጠቃሚዎች ጥሩ ይዘት ዋጋ እንደሚያስከፍል ይገነዘባሉ፣ እንዲሁም ገንዘቡ ከማስታወቂያ ስለመሆኑ አምነው ተቀብለዋል።

source: Which browser is best at keeping things confidential?
am: ነገሮችን ሚስጥራዊ ለማድረግ የትኛው አሳሽ የተሻለ ነው?
